React_Module_Scripts/React_Employee_Delete_api/absenceAPI_smoke.yml
execution:
#- executor: jmeter
- concurrency: 50
  ramp-up: 50s
  iterations: 1429
  scenario: SC05_React_Employee_Delete_Api

scenarios:
  SC05_React_Employee_Delete_Api:
    script: SC05_React_Employee_Delete_Api.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed